Revit 2027 API
AnalyticalPanel.Create(Document, CurveLoop) Method
 Creates a new instance of an Analytical Panel within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AnalyticalPanel Create(
	Document aDoc,
	CurveLoop curveLoop
)
Public Shared Function Create (
	aDoc As Document,
	curveLoop As CurveLoop
) As AnalyticalPanel
public:
static AnalyticalPanel^ Create(
	Document^ aDoc,
	CurveLoop^ curveLoop
)
static member Create :
        aDoc : Document *
        curveLoop : CurveLoop -> AnalyticalPanel
Parameters
aDoc Document
 Revit document.
curveLoop CurveLoop
 CurveLoop for the Analytical Panel.
Return Value
AnalyticalPanel
 The newly created AnalyticalPanel instance.
Exceptions
Exception | Condition
ArgumentException |  One of the following requirements is not satisfied : - curve loop curveLoop is not planar - curve loop curveLoop is self-intersecting - curve loop curveLoop contains zero length curves
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 CurveLoop must be planar and not self-intersecting.
See Also
Reference
AnalyticalPanel Class
Create Overload
Autodesk.Revit.DB.Structure Namespace